---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorModelTooBig
source: html/74449744-4065-7244-60d2-cda609c69274.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPCalculationFailures.NetworkErrorModelTooBig Property

The size of the network exceeds the current limit for flow/pressure analysis. In the Mechanical Settings dialog, under Pipe Settings - Calculation, disable the option to Use analysis for closed loop hydronic networks.

## Syntax (C#)
```csharp
public static FailureDefinitionId NetworkErrorModelTooBig { get; }
```